tap "jstkdng/programs"
brew "ast-grep"
brew "bat"
brew "chafa"
brew "eza"
brew "fd"
brew "fish"
brew "python@3.13"
brew "fontforge"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gnu-sed"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mermaid-cli"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "python-tk@3.13"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "stow"
brew "tectonic"
brew "utftex"
brew "uv"
brew "viu"
brew "wget"
brew "zoxide"
brew "jstkdng/programs/ueberzugpp"
cask "feishu"
cask "font-lxgw-neoxihei"
cask "font-lxgw-neozhisong"
cask "font-lxgw-wenkai"
cask "font-source-han-sans-vf"
cask "font-source-han-serif-vf"
cask "google-chrome@dev"
cask "iina"
cask "macfuse"
cask "movist-pro"
cask "obsidian"
cask "qspace-pro"
cask "visual-studio-code"
cask "wechat"
vscode "antfu.slidev"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "usernamehw.errorlens"
