tap "oven-sh/bun"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "ast-grep"
brew "bat"
brew "ddgr"
brew "sqlite"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "poppler"
brew "procs"
brew "python@3.14"
brew "python-tk@3.14"
brew "ripgrep"
brew "rtk"
brew "sd"
brew "starship"
brew "stow"
brew "stylua"
brew "summarize"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "steipete/tap/remindctl"
brew "yakitrak/yakitrak/obsidian-cli"
cask "blip"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "lark"
cask "libreoffice"
cask "obsidian"
cask "orbstack"
cask "plistedit-pro"
cask "tailscale-app"
cask "visual-studio-code"
cask "wechat"
cask "zed"
vscode "github.copilot-chat"
uv "docx2txt"
uv "img2pdf"
uv "markdown"
uv "mineru"
uv "weasyprint"
