tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "bottom"
brew "btop"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "glow"
brew "gnu-sed"
brew "joshuto"
brew "jq"
brew "lazygit"
brew "python@3.13"
brew "mysql", restart_service: :changed
brew "tree-sitter", args: ["HEAD"]
brew "utf8proc", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "node"
brew "pandoc"
brew "pkgconf"
brew "python-tk@3.13"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "stow"
brew "wget"
brew "zoxide"
cask "cursor"
cask "docker"
cask "easydict"
cask "feishu"
cask "font-hurmit-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-neoxihei"
cask "font-lxgw-neozhisong"
cask "font-lxgw-wenkai"
cask "iina"
cask "macfuse"
cask "microsoft-edge"
cask "miniconda"
cask "movist-pro"
cask "obsidian"
cask "plistedit-pro"
cask "warp"
cask "wechat"
cask "zotero@beta"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.github-vscode-theme"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "ritwickdey.liveserver"
vscode "vincaslt.highlight-matching-tag"
